In [30]:
import pandas as pd
import numpy as np

In [31]:
pd.__version__

'1.2.4'

# pd.Series

In [32]:
# Create Series

my_series = pd.Series(
    [1, 1, 2, 3, np.NaN, 8, 13], 
    index=['a', 'b', 'b', 'd', 'e', 'f', 7]
)
my_series

a     1.0
b     1.0
b     2.0
d     3.0
e     NaN
f     8.0
7    13.0
dtype: float64

In [33]:
# Create Series

my_second_series = pd.Series(
    [13, 8, np.NaN, 3, 2, 1, 1], 
    index=['a', 'b', 'c', 'd', 'e', 'f', 'g']
)
my_second_series

a    13.0
b     8.0
c     NaN
d     3.0
e     2.0
f     1.0
g     1.0
dtype: float64

In [34]:
my_series.index

Index(['a', 'b', 'b', 'd', 'e', 'f', 7], dtype='object')

In [35]:
my_series.values

array([ 1.,  1.,  2.,  3., nan,  8., 13.])

In [36]:
my_series.shape

(7,)

In [37]:
my_series['b']

b    1.0
b    2.0
dtype: float64

In [38]:
# Get slices by position

my_series.iloc[0:6:2]

a    1.0
b    2.0
e    NaN
dtype: float64

In [39]:
# Get value by index

my_series.at['b']

b    1.0
b    2.0
dtype: float64

In [40]:
# Get value by position

my_series.iat[6]

13.0

In [41]:
# Check whether values are contained in Series

my_series.isin([3, 8])

a    False
b    False
b    False
d     True
e    False
f     True
7    False
dtype: bool

In [42]:
# Boolean indexing

my_series[my_series > my_series.mean()]

f     8.0
7    13.0
dtype: float64

### Operations

In [43]:
%%timeit

# Check summation of 2 series

my_series + my_second_series

784 µs ± 7.22 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [44]:
%%timeit

# Check summation of 2 series

my_series.add(my_second_series)

794 µs ± 36.1 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [45]:
# Such kind of summation get NaN for indices that do not overlap 

my_series + my_second_series

7     NaN
a    14.0
b     9.0
b    10.0
c     NaN
d     6.0
e     NaN
f     9.0
g     NaN
dtype: float64

In [46]:
# Special functions are faster and more flexible

my_series.add(my_second_series, fill_value=0)

7    13.0
a    14.0
b     9.0
b    10.0
c     NaN
d     6.0
e     2.0
f     9.0
g     1.0
dtype: float64

In [47]:
# Check that statistical methods automatically exclude missing data

sum_elements = my_series
count_elements = len(my_series)
print(f"Mean: {my_series.mean()}")
print(f"Sum of elements divided by count of elements: {sum_elements/count_elements}")

Mean: 4.666666666666667
Sum of elements divided by count of elements: a    0.142857
b    0.142857
b    0.285714
d    0.428571
e         NaN
f    1.142857
7    1.857143
dtype: float64

In [48]:
# Map function

func_10 = lambda x: x+10
my_series.map(func_10)

a    11.0
b    11.0
b    12.0
d    13.0
e     NaN
f    18.0
7    23.0
dtype: float64

# pd.DataFrame

### Intro

In [49]:
df1 = pd.DataFrame({'country': ['Kazakhstan', 'Russia', 'Belarus', 'Ukraine'],
                    'population': [17.04, 143.5, 9.5, 45.5],
                    'square': [2724902, 17125191, 207600, 603628]},
                   index=['KZ', 'RU', 'BY', 'UA']
)
df1

       country  population    square
KZ  Kazakhstan       17.04   2724902
RU      Russia      143.50  17125191
BY     Belarus        9.50    207600
UA     Ukraine       45.50    603628

In [50]:
df2 = pd.DataFrame(
    data=np.random.rand(5,5),
    columns=['A', 'B', 'C', 'D', 'F']
)
df2

          A         B         C         D         F
0  0.707601  0.934481  0.307479  0.560573  0.553055
1  0.939700  0.894992  0.468660  0.904569  0.539923
2  0.148190  0.457659  0.918419  0.154189  0.354578
3  0.135771  0.729380  0.861287  0.953732  0.732941
4  0.257840  0.889960  0.323885  0.971163  0.382952

In [51]:
# Select one column

df1['country']

KZ    Kazakhstan
RU        Russia
BY       Belarus
UA       Ukraine
Name: country, dtype: object

In [52]:
# Multi-columns selection

df1[['country', 'square']]

       country    square
KZ  Kazakhstan   2724902
RU      Russia  17125191
BY     Belarus    207600
UA     Ukraine    603628

In [53]:
# Slices the rows

df1[0:2]

       country  population    square
KZ  Kazakhstan       17.04   2724902
RU      Russia      143.50  17125191

In [54]:
# Select all rows for some columns

df1.loc[:, ['country', 'square']]

       country    square
KZ  Kazakhstan   2724902
RU      Russia  17125191
BY     Belarus    207600
UA     Ukraine    603628

In [55]:
%%timeit

# Select scalar

df1.loc['KZ', 'country']

6.71 µs ± 400 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [56]:
%%timeit

# Select scalar

df1.at['KZ', 'country']

3.11 µs ± 146 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [57]:
%%timeit

# Select scalar

df1.iloc[0, 0]

19.7 µs ± 729 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [58]:
%%timeit

# Select scalar

df1.iat[0, 0]

17.1 µs ± 842 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [59]:
# Select one row

df1.iloc[3]

country       Ukraine
population       45.5
square         603628
Name: UA, dtype: object

In [60]:
# Select some rows and some columns

df1.iloc[0:3, 0:2]

       country  population
KZ  Kazakhstan       17.04
RU      Russia      143.50
BY     Belarus        9.50

### Operations

In [61]:
# The same issues with actions with DataFrames as with Series

df2.loc[0, 'A'] = np.NaN
print(df2['A'] + df2['B'])
print(' ')
print(df2['A'].add(df2['B'], fill_value=0))

0         NaN
1    1.834692
2    0.605850
3    0.865151
4    1.147799
dtype: float64

0    0.934481
1    1.834692
2    0.605850
3    0.865151
4    1.147799
dtype: float64

In [62]:
# Apply-function is the same with map for Series. Results are not inplaced.

df2.apply(func_10)

           A          B          C          D          F
0        NaN  10.934481  10.307479  10.560573  10.553055
1  10.939700  10.894992  10.468660  10.904569  10.539923
2  10.148190  10.457659  10.918419  10.154189  10.354578
3  10.135771  10.729380  10.861287  10.953732  10.732941
4  10.257840  10.889960  10.323885  10.971163  10.382952

In [63]:
%%timeit

df2.apply(lambda x:round(x))

905 µs ± 69.4 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [64]:
%%timeit

df2.round()

812 µs ± 47.6 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

### Analysis

In [65]:
# Read csv-file

df = pd.read_csv('student-mat.csv', sep=';')

FileNotFoundError: [Errno 2] No such file or directory: 'student-mat.csv'

In [ ]:
# Size of df

df.shape

In [ ]:
df.info()

In [ ]:
df.describe(include='all')

We can change count of visible columns and rows:

In [ ]:
pd.set_option('display.max_columns', 100)
pd.set_option('display.max_rows', 20)

In [ ]:
df.describe(include='all')

In [ ]:
# Select rows where sex is 'F'

df[(df['sex'] == 'F')]

In [ ]:
# Select rows where sex is F and Mjob is equal to "at_home"

df[(df['sex'] == 'F') & (df['Mjob'] == 'at_home')]

In [ ]:
# Check all variants for Mjob

df['Mjob'].value_counts()

In [ ]:
# Select rows where Mjob is "at_home" or "teacher"

interesting_jobs = ['at_home', 'teacher']

df[df['Mjob'].isin(interesting_jobs)]

### Concat

In [27]:
# Create tables for examples

df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])


df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])


df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},               
                    index=[8, 9, 10, 11])

In [28]:
result = pd.concat([df1, df2, df3])

In [29]:
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [30]:
# Adding keys for simplifying indexing

result = pd.concat([df1, df2, df3], keys=['x', 'y', 'z'])

In [31]:
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [32]:
result.loc['y']

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [33]:
# Creating new frame

df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'],
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                   index=[2, 3, 6, 7])

In [34]:
# Check outer join

result = pd.concat([df1, df4], axis=1, join='outer', sort=False)
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [35]:
# Check inner join

result = pd.concat([df1, df4], axis=1, join='inner', sort=False)
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [36]:
# Check how ignore_index works

result = pd.concat([df1, df4], ignore_index=True, sort=False)
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

### Merge

In [37]:
# Create frames

left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})


right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

In [38]:
# Merge on 2 keys with default parameters

result = pd.merge(left, right, on=['key1', 'key2'])
result

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [39]:
# LEFT merge

result = pd.merge(left, right, how='left', on=['key1', 'key2'])
print('Left')
result

Left

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [40]:
# RIGHT merge

result = pd.merge(left, right, how='right', on=['key1', 'key2'])
print('Right')
result

Right

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

### Join

In [41]:
# Create examples of frames

left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                    index=['K0', 'K1', 'K2'])


right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                     index=['K0', 'K2', 'K3'])

result = left.join(right)
result

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

### Groupby

In [ ]:
# Back to our dataset

df.head(10)

In [ ]:
# Calculate how many girls and boys have a romantic relationship

df.groupby(by=['sex', 'romantic'])['romantic'].count()

In [ ]:
# Calculate what proportion of girls and boys have a romantic relationship

df.groupby(by=['sex']).agg({'romantic': lambda x: x.value_counts(normalize=True)['yes']})

### pivot_table

In [ ]:
# Calculate average rate of final grade depending on romantic realtionship and Internet availability by sex

p_table = df.pivot_table(
    values='G3', 
    columns='sex', 
    index=['romantic', 'internet'], 
    aggfunc='mean'
)

p_table

### MultiIndex

In [ ]:
# Create an example of pivot table

p_table = df.pivot_table(
    values='G3', 
    columns='sex', 
    index=['Mjob', 'paid'], 
    aggfunc='mean'
)

p_table

In [ ]:
# In general, we have 3-dimensional dataset. Look at indexes of pivot table

p_table.index

In [ ]:
# Look at level names

p_table.index.names

In [ ]:
# Getting values by column

p_table['F']

In [ ]:
# You can play with grouping by changing the order of these functions

p_table.stack().swaplevel()

In [ ]:
# Restack the table

p_table1 = p_table.unstack()

In [ ]:
# Getting values by columns

p_table1['F']['no']

In [ ]:
# Getting values by 1-level index

p_table.xs('at_home')

In [ ]:
# Getting values by 1-level index

p_table.loc['at_home', :]

In [ ]:
# Getting values by two levels index

p_table.loc[('at_home', 'yes'), :]

In [ ]:
# Getting values by 2-level index

p_table.xs('yes', level='paid')

In [ ]:
# Getting values by slicing

p_table.loc[(slice('b','other'), slice('yes', 'yes')), :]

In [ ]:
# Getting values by slicing

idx = pd.IndexSlice

p_table.loc[idx['at_home':'other',['yes']], :]